tap "beutton/brew"
tap "cloudflare/cloudflare"
tap "homebrew/services"
tap "nikitabobko/tap"
tap "unikraft/tap"
tap "xcodesorg/made"
brew "libtiff"
brew "harfbuzz"
brew "anyenv"
brew "jpeg-xl"
brew "webp"
brew "aom"
brew "arp-scan"
brew "python@3.13"
brew "awscli"
brew "azure-cli"
brew "baobab"
brew "bat"
brew "node"
brew "bitwarden-cli"
brew "caddy"
brew "cmake"
brew "coreutils"
brew "coturn"
brew "curl"
brew "eza"
brew "fd"
brew "sdl2"
brew "ffmpeg"
brew "fluid-synth"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "gnupg"
brew "go"
brew "htop"
brew "httpie"
brew "iperf3"
brew "iproute2mac"
brew "jnv"
brew "jq"
brew "kubo"
brew "llvm"
brew "lld"
brew "marp-cli"
brew "mas"
brew "ncdu"
brew "neovim"
brew "nginx"
brew "ni"
brew "nmap"
brew "ollama", restart_service: :changed
brew "p7zip"
brew "pinentry-mac"
brew "pkgconf"
brew "poppler"
brew "protobuf"
brew "pyenv"
brew "python@3.10"
brew "qemu"
brew "rbenv"
brew "restic"
brew "ripgrep"
brew "ruby", link: false
brew "rustup"
brew "sdl2_gfx"
brew "sdl2_image"
brew "sdl2_mixer"
brew "sdl2_net"
brew "sdl2_ttf"
brew "silicon"
brew "starship"
brew "telnet"
brew "terminal-notifier"
brew "texlive"
brew "tfenv"
brew "tldr"
brew "tmux"
brew "tree"
brew "typst"
brew "unar"
brew "uv"
brew "watch"
brew "websocat"
brew "wget"
brew "xorriso"
brew "x86_64-elf-grub"
brew "yarn"
brew "z"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "cloudflare/cloudflare/cf-terraforming"
brew "kraftkit"
brew "xcodesorg/made/xcodes"
cask "nikitabobko/tap/aerospace"
cask "alacritty"
cask "aquaskk"
cask "bitwarden"
cask "clipy"
cask "deskpad"
cask "docker-desktop"
cask "font-hack-nerd-font"
cask "font-monaspace"
cask "font-noto-sans-cjk-jp"
cask "font-noto-sans-jp"
cask "font-noto-sans-mono"
cask "font-noto-serif-cjk-jp"
cask "font-noto-serif-jp"
cask "font-source-han-code-jp"
cask "font-source-han-sans-vf"
cask "font-source-han-serif-vf"
cask "git-credential-manager"
cask "google-drive"
cask "google-japanese-ime"
cask "macfuse"
cask "multipass"
cask "raycast"
cask "rectangle"
cask "slack"
cask "stats"
cask "visual-studio-code"
cask "beutton/brew/wattsec"
cask "wireshark-app"
cask "zed"
cask "zenmap"
mas "DaVinci Resolve", id: 571213070
mas "GarageBand", id: 682658836
mas "Goodnotes", id: 1444383602
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Klack", id: 6446206067
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "SeeMusic", id: 1494196015
vscode "8amjp.charactercount"
vscode "adamraichu.docx-viewer"
vscode "alexcvzz.vscode-sqlite"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "cloudedcat.vscode-model-viewer"
vscode "cschlosser.doxdocgen"
vscode "danielpinto8zz6.c-cpp-compile-run"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "felipecaputo.git-project-manager"
vscode "fill-labs.dependi"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "grapecity.gc-excelviewer"
vscode "hediet.vscode-drawio"
vscode "ibm.output-colorizer"
vscode "ics.japanese-proofreading"
vscode "james-yu.latex-workshop"
vscode "jithurjacob.nbpreviewer"
vscode "jock.svg"
vscode "jrieken.bisectdemo"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "kleber-swf.unity-code-snippets"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vscode.wordcount"
vscode "ms-vsliveshare.vsliveshare"
vscode "myriad-dreamin.tinymist"
vscode "oderwat.indent-rainbow"
vscode "pkief.markdown-checkbox"
vscode "pkief.material-icon-theme"
vscode "platformio.platformio-ide"
vscode "ptd.vscode-unitymeta"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "s-nlf-fh.glassit"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "swellaby.rust-pack"
vscode "swiftlang.swift-vscode"
vscode "tamasfe.even-better-toml"
vscode "tatsy.vscode-3d-preview"
vscode "tomoki1207.pdf"
vscode "tyriar.luna-paint"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vmsynkov.colonize"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "webfreak.debug"
vscode "wholroyd.jinja"
vscode "xadillax.viml"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
